{
  "name": "Sorcerer",
  "hitDice": "1d6",
  "primaryAbility": "Charisma",
  "savingThrowProficiencies": ["Constitution", "Charisma"],
  "armorProficiencies": [],
  "weaponProficiencies": ["Daggers", "Darts", "Slings", "Quarterstaffs", "Light crossbows"],
  "toolProficiencies": [],
  "skillChoices": {
    "count": 2,
    "from": [
      "Arcana",
      "Deception",
      "Insight",
      "Intimidation",
      "Persuasion",
      "Religion"
    ]
  },
  "startingEquipment": [
    {
      "choice": [
        "A light crossbow and 20 bolts",
        "Any simple weapon"
      ]
    },
    {
      "choice": [
        "A component pouch",
        "An arcane focus"
      ]
    },
    {
      "choice": [
        "A dungeoneer's pack",
        "An explorer's pack"
      ]
    },
    "Two daggers"
  ],
  "features": {
    "1": [
      {
        "name": "Spellcasting",
        "description": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the sorcerer spell list."
      },
      {
        "name": "Sorcerous Origin",
        "description": "Choose a sorcerous origin, which describes the source of your innate magical power. Your choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level."
      }
    ],
    "2": [
      {
        "name": "Font of Magic",
        "description": "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects.",
        "sorceryPoints": "Equal to your sorcerer level"
      },
      {
        "name": "Flexible Casting",
        "description": "You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels.",
        "creatingSpellSlots": {
          "1st": "2 sorcery points",
          "2nd": "3 sorcery points",
          "3rd": "5 sorcery points",
          "4th": "6 sorcery points",
          "5th": "7 sorcery points"
        },
        "convertingSpellSlot": "As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot's level."
      }
    ],
    "3": [
      {
        "name": "Metamagic",
        "description": "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level.",
        "options": [
          "Careful Spell: When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell.",
          "Distant Spell: When you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell. When you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet.",
          "Empowered Spell: When you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.",
          "Extended Spell: When you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours.",
          "Heightened Spell: When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell.",
          "Quickened Spell: When you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting.",
          "Subtle Spell: When you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components.",
          "Twinned Spell: When you cast a spell that targets only one creature and doesn't have a range of self, you can spend a number of sorcery points equal to the spell's level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip)."
        ]
      }
    ],
    "4": [
      {
        "name": "Ability Score Improvement",
        "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
      }
    ],
    "5": []
  },
  "spellcasting": {
    "ability": "Charisma",
    "spellAttackModifier": "proficiency bonus + Charisma modifier",
    "spellSaveDC": "8 + proficiency bonus + Charisma modifier",
    "ritualCasting": false,
    "spellcastingFocus": "You can use an arcane focus as a spellcasting focus for your sorcerer spells.",
    "spellsKnownDescription": "You know four cantrips and two 1st-level spells of your choice from the sorcerer spell list. You learn additional sorcerer spells of your choice at higher levels.",
    "cantripsKnown": {
      "1": 4,
      "4": 5,
      "10": 6
    },
    "spellsKnown": {
      "1": 2,
      "2": 3,
      "3": 4,
      "4": 5,
      "5": 6
    },
    "spellSlots": {
      "1": {"1st": 2},
      "2": {"1st": 3},
      "3": {"1st": 4, "2nd": 2},
      "4": {"1st": 4, "2nd": 3},
      "5": {"1st": 4, "2nd": 3, "3rd": 2}
    }
  },
  "subclasses": {
    "1": [
      {
        "name": "Draconic Bloodline",
        "description": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors.",
        "features": {
          "1": [
            {
              "name": "Dragon Ancestor",
              "description": "At 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later. You can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check."
            },
            {
              "name": "Draconic Resilience",
              "description": "As magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class. Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren't wearing armor, your AC equals 13 + your Dexterity modifier."
            }
          ]
        }
      },
      {
        "name": "Wild Magic",
        "description": "Your innate magic comes from the wild forces of chaos that underlie the order of creation.",
        "features": {
          "1": [
            {
              "name": "Wild Magic Surge",
              "description": "Starting when you choose this origin at 1st level, your spellcasting can unleash surges of untamed magic. Immediately after you cast a sorcerer spell of 1st level or higher, the DM can have you roll a d20. If you roll a 1, roll on the Wild Magic Surge table to create a random magical effect."
            },
            {
              "name": "Tides of Chaos",
              "description": "Starting at 1st level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. Once you do so, you must finish a long rest before you can use this feature again. Any time before you regain the use of this feature, the DM can have you roll on the Wild Magic Surge table immediately after you cast a sorcerer spell of 1st level or higher. You then regain the use of this feature."
            }
          ]
        }
      }
    ]
  }
}